import React from "react";

export default function Privacy() {
  return (
      <>
        <div className="flex-grow flex items-center justify-center py-12 px-4 sm:px-6 lg:px-8">
          <div className="w-full max-w-6xl">
            <div className="p-6 sm:p-8 md:p-12">
              <h1 className="text-3xl sm:text-4xl font-extrabold text-center text-gray-800 mb-6">
                Политика конфиденциальности
              </h1>
              <div className="text-gray-600 text-sm sm:text-base leading-relaxed space-y-6">
                <p>
                  <strong>Общие положения</strong>
                  <br />
                  Настоящая «Политика безопасности обработки персональных данных»
                  разработана в соответствии с положениями действующего
                  национального законодательства, включая Закон № 133 от
                  08.07.2011 о защите персональных данных, и регулирует порядок
                  сбора и использования этой информации.
                </p>
                <p>
                  <strong>Сбор персональных данных</strong>
                  <br />
                  Целью настоящей политики безопасности является обеспечение
                  надлежащего уровня защиты персональных данных заинтересованных
                  лиц.
                </p>
                <p>
                  <strong>Обработка персональных данных</strong>
                  <br />
                  Обработка персональных данных осуществляется с использованием
                  смешанных методов (ручных и автоматических), в соответствии с
                  требованиями законодательства.
                </p>
                <p>
                  В соответствии с положениями Закона № 133 от 08.07.2011, субъект
                  персональных данных имеет следующие права:
                  <ul className="list-disc list-inside mt-2 space-y-1">
                    <li>Право на доступ к персональным данным;</li>
                    <li>Право на вмешательство в персональные данные;</li>
                    <li>Право на возражение против обработки персональных данных.</li>
                  </ul>
                </p>
                <p>
                  <strong>Безопасность информации</strong>
                  <br />
                  Меры безопасности персональных данных устанавливаются таким
                  образом, чтобы обеспечить надлежащий уровень защиты
                  обрабатываемых персональных данных.
                </p>
                <p>
                  <strong>Принципы обработки персональных данных</strong>
                  <br />
                  Персональные данные обрабатываются добросовестно и в
                  соответствии с действующими законодательными положениями.
                </p>
                <p>
                  Будут приняты необходимые меры для обеспечения конфиденциальности персональных данных в соответствии с законодательством.
                </p>
              </div>
            </div>
          </div>
        </div>
      </>
  );
}
