import React from "react";

export default function InfoRCA() {
    return (
        <>
            <div className="flex-grow flex items-center justify-center py-12 px-4 sm:px-6 lg:px-8">
                <div className="w-full max-w-3xl p-8 text-left">
                        <h1 className="text-3xl sm:text-4xl font-extrabold text-gray-800 mb-6">
                            ОСАГО (RCA)
                        </h1>
                        <p className="text-gray-600 text-sm sm:text-base mb-8 leading-relaxed">
                            ОСАГО, или Обязательное страхование автогражданской ответственности, — это ваш надежный щит на дорогах Молдовы. Этот тип страхования защищает права людей, которые могут пострадать в авариях, случайно вызванных вами. Это означает, что если произойдет несчастный случай, страховка поможет покрыть расходы на лечение пострадавших, ремонт их автомобилей и компенсацию других убытков. Наличие ОСАГО обязательно для всех водителей. Перед тем как сесть за руль, убедитесь, что ваш полис активен. И помните, игнорирование этого правила может привести к большим штрафам. Выбирая страховую компанию, не останавливайтесь только на цене полиса. Важно учитывать репутацию компании, качество обслуживания и скорость выплат. Правильный выбор поможет избежать дополнительных хлопот в случае аварии и гарантирует, что вы и пострадавшие получите необходимую поддержку и компенсацию.
                        </p>
                </div>
            </div>
        </>
    );
}
