import React from "react";

export default function Terms() {
    return (
        <>
            <div className="flex-grow flex items-center justify-center py-12 px-4 sm:px-6 lg:px-8">
                <div className="w-full max-w-6xl">
                    <div className="p-6 sm:p-8 md:p-12">
                        <h1 className="text-3xl sm:text-4xl font-extrabold text-center text-gray-800 mb-6">
                            Условия и положения
                        </h1>
                        <div className="text-gray-600 text-sm sm:text-base leading-relaxed space-y-6">
                            <p>
                                <strong>Общие сведения</strong>
                                <br/>
                                Страница topasig.md, далее именуемая как 'Сайт', принадлежит и управляется компанией
                                BROKER DE ASIGURARE-REASIGURARE TOPASIG S.R.L. (фискальный код 1015600028283). Сайт
                                является электронной платформой,
                                на которой представлены предложения партнеров-продавцов страховых продуктов. BROKER DE
                                ASIGURARE-REASIGURARE TOPASIG S.R.L. не обязуется проверять информацию, предоставленную
                                партнерами-продавцами,
                                поэтому рекомендуем ознакомиться с условиями страхования каждого партнера, доступными на
                                Сайте.
                            </p>
                            <p>
                                <strong>Использование страницы и защита информации</strong>
                                <br/>
                                Использовать Сайт могут только лица, обладающие полной дееспособностью, которые
                                принимают на себя все обязательства и права, вытекающие из использования Сайта. Для
                                корректного функционирования Сайта в браузере пользователя должны быть активированы
                                JavaScript и cookies. Сайт защищен с помощью шифрованного соединения HTTPS, передача
                                личных данных осуществляется через протокол TLS-шифрования 256 бит. BROKER DE
                                ASIGURARE-REASIGURARE TOPASIG S.R.L. прилагает все усилия для обеспечения безопасности
                                передаваемых данных. Пользователь
                                может отказаться от заказанной услуги в любой момент до вступления в силу страхового
                                договора.
                            </p>
                            <p>
                                <strong>Применение и принятие условий</strong>
                                <br/>
                                Сайт представляет предложения партнеров-продавцов страховых продуктов. Использование
                                Сайта, услуг и контента возможно только при условии безоговорочного согласия с условиями
                                настоящего договора. Если вы не принимаете эти условия, не используйте Сайт и его
                                услуги.
                            </p>
                            <p>
                                <strong>Описание услуг</strong>
                                <br/>
                                Сайт предоставляет пользователям доступ к базе данных, содержащей предложения по ценам
                                на страховые продукты, и возможность изучить условия страхования партнеров-продавцов.
                                BROKER DE ASIGURARE-REASIGURARE TOPASIG S.R.L. выступает в роли пассивного посредника в
                                онлайн-распределении
                                страховых продуктов и публикации информации, предоставленной партнерами-продавцами.
                                BROKER DE ASIGURARE-REASIGURARE TOPASIG S.R.L. не обязана проверять информацию,
                                предоставленную
                                партнерами-продавцами, доступную на Сайте.
                            </p>
                            <p>
                                <strong>Заключение страхового договора</strong>
                                <br/>
                                Заключение страхового договора через Сайт осуществляется на основании следующих
                                документов:
                                <ul className="list-disc list-inside mt-2 space-y-1">
                                    <li>Настоящий документ 'Условия и положения';</li>
                                    <li>Заявка на предложение пользователя;</li>
                                    <li>Предложения, сообщаемые пользователю партнерами-продавцами Сайта;</li>
                                    <li>Условия страхования партнеров-продавцов.</li>
                                </ul>
                            </p>
                            <p>
                                <strong>Процедура заключения договора</strong>
                                <br/>
                                <ul className="list-decimal list-inside mt-2 space-y-1">
                                    <li>Пользователь заполняет форму заявки на предложение, выбирая опцию 'Заказ'. На
                                        основании предоставленной информации система рассчитывает страховую премию.
                                    </li>
                                    <li>Страховая премия, рассчитанная системой, проверяется и подтверждается
                                        уполномоченным лицом от партнера-продавца в рабочее время. Премия может
                                        изменяться в зависимости от точности введенных данных и обменных курсов.
                                    </li>
                                    <li>Если пользователь согласен с рассчитанной страховой премией, он подтверждает
                                        свое согласие на обработку личных данных, осведомленность и согласие с условиями
                                        страхования, предоставленными партнерами-продавцами.
                                    </li>
                                    <li>Информационная система анализирует заявку пользователя и автоматически сохраняет
                                        предложение по страхованию, включая подробную информацию о страховом договоре, а
                                        также информацию о стоимости и способах оплаты страховой премии.
                                    </li>
                                    <li>После согласования предложения со страховой компанией или брокером пользователь
                                        выбирает способ оплаты страховой премии. Оплата производится непосредственно на
                                        счет страховой компании или ее уполномоченного представителя.
                                    </li>
                                    <li>Электронный страховой договор заключается в момент поступления страховой премии
                                        или первого взноса на указанный банковский счет или после подтверждения оплаты
                                        (для онлайн-платежей).
                                    </li>
                                </ul>
                            </p>
                            <p>
                                <strong>Электронные страховые полисы</strong>
                                <br/>
                                Электронные полисы доступны пользователю только в электронном виде и регистрируются в
                                течение 5 минут после оплаты. Если полис не был получен на указанный электронный адрес,
                                пользователю необходимо перейти по ссылке для заказа и скачать
                                полис. Если скачать полис невозможно, свяжитесь с нами по электронной почте
                                info@topasig.md.
                            </p>
                            <p>
                                Срок действия страхового полиса можно проверить на официальном сайте BNM
                                https://rca.bnm.md/.
                            </p>
                            <p>
                                <strong>Заявление о личной ответственности</strong>
                                <br/>
                                Клиент заявляет под личную ответственность, что на дату заключения страхового договора
                                не произошло событий, приводящих к убыткам, и нет неразрешенных убытков. Любая попытка
                                заявить о возмещении существующих или ранее не сообщенных убытков является нарушением
                                условий договора и может повлечь за собой юридические действия против клиента.
                            </p>
                            <p>
                                <strong>Прекращение страхового договора</strong>
                                <br/>
                                Прекращение договора возможно только до его вступления в силу; в противном случае
                                прекращение возможно только в центральном офисе страховой компании в соответствии с
                                действующим законодательством.
                            </p>
                            <p>
                                <strong>Защита личных данных</strong>
                                <br/>
                                Обработка личных данных осуществляется в соответствии с законодательными нормами
                                Республики Молдова. В соответствии с положениями Закона № 133 от 08.07.2011 о защите
                                личных данных, BROKER DE ASIGURARE-REASIGURARE TOPASIG S.R.L. обязуется администрировать предоставленные личные
                                данные в условиях безопасности и использовать их исключительно для указанных целей.
                            </p>
                            <p>
                                <strong>Оплата и доставка</strong>
                                <br/>
                                Электронные полисы доставляются онлайн на указанный электронный адрес и доступны для
                                скачивания в личном кабинете. Для получения бумажных полисов необходимо лично посетить
                                один из офисов BROKER DE ASIGURARE-REASIGURARE TOPASIG S.R.L..
                            </p>
                            <p>
                                <strong>Подписание с помощью SMS OTP</strong>
                                <br/>
                                Подписывая договор с помощью SMS-подписи через OTP пароль, клиент соглашается со всеми
                                условиями, изложенными в данном документе.
                            </p>
                            <p>
                                <strong>ОФОРМЛЕНИЕ ЗАКАЗА И ОПЛАТА</strong>
                                <br/>
                                Оплата заказов возможна платежной картой - при получении заказа вы получите налоговую
                                квитанцию, которая подтвердит оплату.
                            </p>
                            <p>
                                Онлайн-оплата производится в условиях максимальной безопасности с использованием
                                платежной карты в качестве платежного инструмента, что позволяет осуществлять
                                онлайн-транзакции. После оплаты вы получите подтверждение платежа на свой адрес
                                электронной почты.
                            </p>
                            <p>
                                Платежный процессор использует безопасную систему, основанную на последней версии
                                стандарта безопасности 3D-Secure, что означает новый глобальный подход к аутентификации
                                покупателя в безопасных онлайн-транзакциях. Эта мера безопасности включает
                                перенаправление пользователя при совершении платежа на безопасную страницу maib, где
                                аутентификация каждого держателя карты выполняется путем присвоения одноразового кода
                                для каждой онлайн-транзакции.
                            </p>
                            <p>
                                Возврат денежных средств осуществляется только на ту платежную карту, которая
                                использовалась для покупки.
                            </p>
                            <p>
                                Для оплаты вам потребуется ввести данные вашей банковской карты. Передача этой
                                информации осуществляется с соблюдением всех необходимых мер безопасности. Информация
                                передается в зашифрованном виде и хранится только на специализированном сервере
                                платежной системы.
                            </p>
                            <p>
                                Для проведения платежа будут запрошены следующие данные:
                                <ul className="list-disc list-inside mt-2 space-y-1">
                                    <li>Номер карты (16 цифр);</li>
                                    <li>Срок истечения (месяц и год);</li>
                                    <li>CVC или CVV код (3 цифры);</li>
                                    <li>Имя и фамилия на платежной карте.</li>
                                </ul>
                            </p>
                            <p>
                                Все платежи обрабатываются в национальной валюте - MDL (молдавские леи). В случае если
                                валюта операции отличается от валюты платежа, конвертация суммы операции осуществляется
                                по курсу карточных операций на день расчетов банка-эмитента.
                            </p>
                        </div>
                    </div>
                </div>
            </div>
        </>
    );
}